{
  "contact": {
    "firstname": "Phillip",
    "lastname": "Webb",
    "phone": "07719 123327",
    "email": "phillip.webb@nntp.uk",
    "linkedin": "iamphillipwebb"
  },
  "about": [
    "Support-focused developer with 15 years of experience troubleshooting complex applications, training users and enhancing system performance and functionality in pharmacovigilance, time-and-attendance, and access control."
  ],
  "employment": [
    {
      "employer": "Ennov",
      "location": "St. Neots",
      "role": "Development Engineer",
      "from": "2021-11",
      "to": "2025-09",
      "description": "Part of a Scrum team developing a pharmacovigilance web application using Angular, Java, and Oracle; building search and administrative features for user access, reporting and product management.",
      "skills": [
        "Angular",
        "Java",
        "Oracle SQL",
        "Jenkins",
        "Liquibase",
        "Solr",
        "DevExtreme",
        "HTML5",
        "CSS3",
        "JavaScript",
        "TypeScript",
        "Linux",
        "Git",
        "REST API",
        "Spring Data JPA",
        "Jasmine",
        "Bash Scripting",
        "Golang",
        "Microservices",
        "IntelliJ IDEA",
        "Scrum"
      ],
      "tasks": [
        "Managing Jenkins deployment pipelines for Linux Docker environments",
        "Optimising data export with Apache POI for efficient data handling",
        "Designing Spring Boot microservices with scalable API endpoints",
        "Writing Jasmine unit tests to ensure frontend application reliability",
        "Conducting technical feasibility assessments and performing peer code reviews"
      ]
    },
    {
      "employer": "Ennov",
      "location": "St. Neots",
      "role": "Software Support Analyst",
      "from": "2013-11",
      "to": "2021-11",
      "description": "Experienced in supporting a pharmacovigilance database, troubleshooting software issues, providing user support, and ensuring data integrity.",
      "skills": [
        "ITIL",
        "XML",
        "XSLT",
        "Oracle SQL",
        "Microsoft IIS",
        "RemoteApp",
        "Python",
        "AutoIt3",
        "C# .NET",
        "Google Apps Script"
      ],
      "tasks": [
        "Delivered technical support and user training, efficiently resolving support tickets",
        "Implemented system and database enhancements to improve functionality and performance",
        "Generated monthly issue reports for custom insights and tracking",
        "Developed applications to streamline internal support team workflows",
        "Created a web-based troubleshooting interface for customer connectivity diagnostics"
      ]
    },
    {
      "employer": "Tensor",
      "location": "St. Neots",
      "role": "Helpdesk Analyst",
      "from": "2010-07",
      "to": "2013-10",
      "description": "Application and hardware support for customers using time and attendance, access control, personnel and energy management systems. Security vetted as non-police personnel by West Midlands Police.",
      "skills": [
        "Microsoft SQL",
        "MSDE",
        "SimpleHelp",
        "Remote Access"
      ],
      "tasks": [
        "Microsoft SQL and MSDE database configuration and support",
        "Technical hardware installation guidance given to electrical engineers",
        "Firmware and software upgrades executed using remote access tools",
        "Application server migration and software installation support"
      ]
    },
    {
      "employer": "NHS Anglia Support Partnership",
      "location": "Huntingdon",
      "role": "Service Desk Analyst",
      "from": "2010-02",
      "to": "2010-07",
      "description": "First line service desk role delivering IT and Facilities support to NHS Strategic Health Authority and Primary Care Trust staff across the Anglia region.",
      "skills": [
        "Microsoft Office",
        "Microsoft Active Directory",
        "Microsoft Outlook",
        "Hornbill Service Desk"
      ],
      "tasks": [
        "Microsoft Windows Active Directory account administration",
        "Microsoft Exchange 2007 account management via OWA",
        "Enforcing NHS Trust IT and email policies",
        "Microsoft Office 2003/2007 application support"
      ]
    },
    {
      "employer": "Itim",
      "location": "Huntingdon",
      "role": "Software Support Analyst",
      "from": "2006-12",
      "to": "2010-02",
      "description": "Second line support role, including out-of-hours support for retailers in the UK and Europe using Itim end-to-end retail applications.",
      "skills": [
        "EPOS",
        "EFT",
        "YesPay",
        "Microsoft SQL",
        "DP4",
        "Remote Access"
      ],
      "tasks": [
        "EFT and EPoS software and hardware support for shop floor and back office teams",
        "Responsible for EPoS provision and management for new and refitted stores",
        "Resolved support requests using remote access applications",
        "Microsoft SQL and DP4 database management"
      ]
    },
    {
      "employer": "iCare UK",
      "location": "St. Neots",
      "role": "Support Technician",
      "from": "2005-05",
      "to": "2006-11",
      "description": "IT support role for UK and European customers in small or home office environments. In addition to this role I provided administrative support to Sales staff.",
      "skills": [
        "MacOS X",
        "Microsoft Windows",
        "Microsoft Office"
      ],
      "tasks": [
        "Provided Microsoft Windows and Office application support to customers",
        "Maintained records of customer requests, incidents and assets",
        "Produced quotes, invoices and contracts for scheduled work",
        "Gave technical sales advice to customers"
      ]
    },
    {
      "employer": "Hotspot Bakery",
      "location": "St. Neots",
      "role": "Baker",
      "from": "2004-06",
      "to": "2006-11",
      "description": "A skilled baker with experience producing frozen pies, pastries, bread and cakes while maintaining high standards of quality and safety.",
      "skills": [],
      "tasks": [
        "Safely operated machinery and maintained cleanliness to meet regulations",
        "Managed inventory to ensure ingredient availability and product quality",
        "Worked with the team to improve production efficiency"
      ]
    },
    {
      "employer": "T-Auctions",
      "location": "St. Neots",
      "role": "Hardware Technician",
      "from": "2003-07",
      "to": "2004-06",
      "description": "IT recycling technician with hands-on experience in managing the lifecycle of decommissioned electronic equipment.",
      "skills": [],
      "tasks": [
        "Efficiently processed pallets of printers, monitors, desktop and notebook computers",
        "Destroyed data to ensure compliance with data protection regulations",
        "Cleaned and refurbished devices to meet quality standards for resale at auction"
      ]
    }
  ],
  "education": [
    {
      "institute": "The Open University",
      "location": "Milton Keynes",
      "from": "2014-02",
      "to": "2017-04",
      "courses": [
        {
          "name": "Web Technologies (TT284)",
          "level": ""
        },
        {
          "name": "Discovering Mathematics (MU123)",
          "level": ""
        },
        {
          "name": "Technologies in Practice (TM129)",
          "level": ""
        },
        {
          "name": "My Digital Life (TU100)",
          "level": ""
        }
      ]
    },
    {
      "institute": "Peterborough Regional College",
      "location": "Peterborough",
      "from": "1999-09",
      "to": "2003-07",
      "courses": [
        {
          "name": "Information & Communication Technology",
          "level": "GNVQ Intermediate"
        },
        {
          "name": "Sports, Recreation and Allied Occupations Leadership",
          "level": "NVQ Level 2"
        },
        {
          "name": "Adult Numeracy",
          "level": "NVQ Level 1"
        }
      ]
    }
  ],
  "interests": [
    "I play inline hockey with a local club and serve on the club committee, where I am responsible for development and maintenance of our online roster, using PHP, Vue.JS, Google Apps Script and SQLite/MariaDB, allowing skaters to confirm their attendance at each session.",
    "My enthusiasm for technology focuses on security and open-source software. I am a dedicated Linux user and actively manage several self-hosted services, allowing me to develop new skills."
  ]
}