{
  "contact": {
    "firstname": "Phillip",
    "lastname": "Webb",
    "phone": "07719 123327",
    "email": "phillip.webb@nntp.uk",
    "linkedin": "iamphillipwebb"
  },
  "about": [
    "I am a support focused software engineer with more than 15 years of experience across application support and web development, much of it spent working with complex, business critical systems. My background has given me a practical, user-centred mindset, with a strong focus on reliability, performance, and solving real problems rather than building solutions in isolation."
  ],
  "employment": [
    {
      "employer": "Ennov",
      "location": "St. Neots",
      "role": "Development Engineer",
      "from": "2021-11",
      "to": "2025-09",
      "description": "Delivered a pharmacovigilance web application, using Angular, Java, and Oracle to implement search, administration, reporting, and product management functionality, as a member of a Scrum team.",
      "skills": [
        "Angular",
        "Java",
        "Oracle SQL",
        "Jenkins",
        "Liquibase",
        "Solr",
        "DevExtreme",
        "HTML5",
        "CSS3",
        "JavaScript",
        "TypeScript",
        "Linux",
        "Git",
        "REST API",
        "Spring Data JPA",
        "Jasmine",
        "Bash Scripting",
        "Golang",
        "Microservices",
        "IntelliJ IDEA",
        "Scrum"
      ],
      "tasks": [
        "Maintained and enhanced Jenkins CI/CD pipelines supporting Docker-based Linux deployments",
        "Improved data export performance and scale through Apache POI optimisation",
        "Designed and implemented Spring Boot microservices with secure, scalable REST APIs",
        "Developed comprehensive Jasmine unit tests to validate and stabilise frontend functionality",
        "Evaluated technical feasibility of new features and participated in structured peer code reviews"
      ]
    },
    {
      "employer": "Ennov",
      "location": "St. Neots",
      "role": "Software Support Analyst",
      "from": "2013-11",
      "to": "2021-11",
      "description": "Provided long term application and database support for a pharmacovigilance platform, resolving complex issues, assisting users, and maintaining high standards of data integrity and system reliability.",
      "skills": [
        "ITIL",
        "XML",
        "XSLT",
        "Oracle SQL",
        "Microsoft IIS",
        "RemoteApp",
        "Python",
        "AutoIt3",
        "C# .NET",
        "Google Apps Script"
      ],
      "tasks": [
        "Delivered technical support and user training while efficiently managing support tickets",
        "Implemented system and database improvements to enhance functionality and performance",
        "Produced monthly issue and trend reports to support tracking and operational insights",
        "Developed internal tools and applications to streamline and automate support team workflows",
        "Built a web-based troubleshooting interface to diagnose and resolve customer connectivity issues"
      ]
    },
    {
      "employer": "Tensor",
      "location": "St. Neots",
      "role": "Helpdesk Analyst",
      "from": "2010-07",
      "to": "2013-10",
      "description": "Provided remote application and hardware support for customers using time and attendance, access control, personnel, and energy management systems; security vetted as non-police personnel by West Midlands Police.",
      "skills": [
        "Microsoft SQL",
        "MSDE",
        "SimpleHelp",
        "Remote Access"
      ],
      "tasks": [
        "Configured and supported Microsoft SQL and MSDE databases to ensure reliable system operation",
        "Provided technical guidance to electrical engineers during on-site hardware installations",
        "Performed firmware and software upgrades using secure remote access tools",
        "Supported application server migrations and carried out software installations"
      ]
    },
    {
      "employer": "NHS Anglia Support Partnership",
      "location": "Huntingdon",
      "role": "Service Desk Analyst",
      "from": "2010-02",
      "to": "2010-07",
      "description": "Delivered first line IT and facilities management support to NHS Strategic Health Authority and Primary Care Trust staff across the Anglia region, gaining experience in user support, account administration, and IT policy compliance.",
      "skills": [
        "Microsoft Office",
        "Microsoft Active Directory",
        "Microsoft Outlook",
        "Hornbill Service Desk"
      ],
      "tasks": [
        "Administered Microsoft Windows Active Directory accounts",
        "Managed Microsoft Exchange 2007 accounts via OWA to support community staff",
        "Enforced NHS Trust IT and email policies to maintain compliance and data security",
        "Provided support for Microsoft Office 2003/2007 applications to resolve user issues"
      ]
    },
    {
      "employer": "Itim",
      "location": "Huntingdon",
      "role": "Software Support Analyst",
      "from": "2006-12",
      "to": "2010-02",
      "description": "Supported UK head office and shop staff using Itim retail applications, including out-of-hours, developing expertise in software, hardware, and database management.",
      "skills": [
        "EPOS",
        "EFT",
        "YesPay",
        "Microsoft SQL",
        "DP4",
        "Remote Access"
      ],
      "tasks": [
        "Delivered EFT and EPoS software and hardware support to shop floor and back office teams",
        "Managed EPoS provisioning for new and refitted retail stores",
        "Resolved support requests efficiently using remote access tools, maintaining high service levels",
        "Managed Microsoft SQL and DP4 databases to support reliable application performance"
      ]
    },
    {
      "employer": "iCare UK",
      "location": "St. Neots",
      "role": "Support Technician",
      "from": "2005-05",
      "to": "2006-11",
      "description": "Provided IT support for UK and European small and home office customers, while assisting Sales staff with administrative tasks, building foundational skills in customer support, technical troubleshooting, and office systems.",
      "skills": [
        "MacOS X",
        "Microsoft Windows",
        "Microsoft Office"
      ],
      "tasks": [
        "Provided Microsoft Windows and Office application support to customers",
        "Maintained accurate records of customer requests, incidents, and IT assets",
        "Prepared quotes, invoices, and contracts for scheduled work, supporting sales operations",
        "Advised customers on technical solutions and pre-sales recommendations"
      ]
    },
    {
      "employer": "Hotspot Bakery",
      "location": "St. Neots",
      "role": "Baker",
      "from": "2004-06",
      "to": "2006-11",
      "description": "Produced and baked pastries, bread, and cakes, and baked frozen pies, ensuring consistent quality, hygiene, and safety standards.",
      "skills": [],
      "tasks": [
        "Operated bakery machinery safely and maintained a clean work environment to meet regulations",
        "Managed inventory to ensure consistent ingredient availability and product quality",
        "Collaborated with the team to improve production efficiency and workflow"
      ]
    },
    {
      "employer": "T-Auctions",
      "location": "St. Neots",
      "role": "Hardware Technician",
      "from": "2003-07",
      "to": "2004-06",
      "description": "Managed the lifecycle of decommissioned computer equipment, ensuring secure data destruction and preparing devices for resale while maintaining quality standards.",
      "skills": [],
      "tasks": [
        "Processed pallets of printers, monitors, desktop, and notebook computers efficiently",
        "Destroyed data to comply with data protection regulations",
        "Cleaned and refurbished devices to meet quality standards for resale at auction"
      ]
    }
  ],
  "education": [
    {
      "institute": "The Open University",
      "location": "Milton Keynes",
      "from": "2014-02",
      "to": "2017-04",
      "courses": [
        {
          "name": "Web Technologies (TT284)",
          "level": ""
        },
        {
          "name": "Discovering Mathematics (MU123)",
          "level": ""
        },
        {
          "name": "Technologies in Practice (TM129)",
          "level": ""
        },
        {
          "name": "My Digital Life (TU100)",
          "level": ""
        }
      ]
    },
    {
      "institute": "Peterborough Regional College",
      "location": "Peterborough",
      "from": "1999-09",
      "to": "2003-07",
      "courses": [
        {
          "name": "Information & Communication Technology",
          "level": "GNVQ Intermediate"
        },
        {
          "name": "Sports, Recreation and Allied Occupations Leadership",
          "level": "NVQ Level 2"
        },
        {
          "name": "Adult Numeracy",
          "level": "NVQ Level 1"
        }
      ]
    }
  ],
  "interests": [
    "Technology enthusiast with experience using Linux for server and desktop computing, with special interest in security, and open-source software. I develop and maintain self-hosted projects for both personal use, and by a local sports club where I serve on the committee.",
    "My recent projects have focused on PHP, MySQL, Vue.JS and Google Apps Script, and I am currently exploring Cloudflare Workers KV and D1, as well as the Handlebars templating language and HTMX JavaScript library."
  ]
}